is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg064.h
#define _IPC42_PREIS_POSITION                    0x00000000
#define _IPC42_PREIS_MASK                        0x00000003
#define _IPC42_PREIS_LENGTH                      0x00000002

#define _IPC42_PREIP_POSITION                    0x00000002
#define _IPC42_PREIP_MASK                        0x0000001C
#define _IPC42_PREIP_LENGTH                      0x00000003

#define _IPC42_SQI1IS_POSITION                   0x00000008
#define _IPC42_SQI1IS_MASK                       0x00000300
#define _IPC42_SQI1IS_LENGTH                     0x00000002

#define _IPC42_SQI1IP_POSITION                   0x0000000A
#define _IPC42_SQI1IP_MASK                       0x00001C00
#define _IPC42_SQI1IP_LENGTH                     0x00000003

#define _IPC42_U4EIS_POSITION                    0x00000010
#define _IPC42_U4EIS_MASK                        0x00030000
#define _IPC42_U4EIS_LENGTH                      0x00000002

#define _IPC42_U4EIP_POSITION                    0x00000012
#define _IPC42_U4EIP_MASK                        0x001C0000
#define _IPC42_U4EIP_LENGTH                      0x00000003

#define _IPC42_U4RXIS_POSITION                   0x00000018
#define _IPC42_U4RXIS_MASK                       0x03000000
#define _IPC42_U4RXIS_LENGTH                     0x00000002

#define _IPC42_U4RXIP_POSITION                   0x0000001A
#define _IPC42_U4RXIP_MASK                       0x1C000000
#define _IPC42_U4RXIP_LENGTH                     0x00000003

#define _IPC42_w_POSITION                        0x00000000
#define _IPC42_w_MASK                            0xFFFFFFFF
#define _IPC42_w_LENGTH                          0x00000020

#define _IPC43_U4TXIS_POSITION                   0x00000000
#define _IPC43_U4TXIS_MASK                       0x00000003
#define _IPC43_U4TXIS_LENGTH                     0x00000002

#define _IPC43_U4TXIP_POSITION                   0x00000002
#define _IPC43_U4TXIP_MASK                       0x0000001C
#define _IPC43_U4TXIP_LENGTH                     0x00000003

#define _IPC43_I2C4BIS_POSITION                  0x00000008
#define _IPC43_I2C4BIS_MASK                      0x00000300
#define _IPC43_I2C4BIS_LENGTH                    0x00000002

#define _IPC43_I2C4BIP_POSITION                  0x0000000A
#define _IPC43_I2C4BIP_MASK                      0x00001C00
#define _IPC43_I2C4BIP_LENGTH                    0x00000003

#define _IPC43_I2C4SIS_POSITION                  0x00000010
#define _IPC43_I2C4SIS_MASK                      0x00030000
#define _IPC43_I2C4SIS_LENGTH                    0x00000002

#define _IPC43_I2C4SIP_POSITION                  0x00000012
#define _IPC43_I2C4SIP_MASK                      0x001C0000
#define _IPC43_I2C4SIP_LENGTH                    0x00000003

#define _IPC43_I2C4MIS_POSITION                  0x00000018
#define _IPC43_I2C4MIS_MASK                      0x03000000
#define _IPC43_I2C4MIS_LENGTH                    0x00000002

#define _IPC43_I2C4MIP_POSITION                  0x0000001A
#define _IPC43_I2C4MIP_MASK                      0x1C000000
#define _IPC43_I2C4MIP_LENGTH                    0x00000003

#define _IPC43_w_POSITION                        0x00000000
#define _IPC43_w_MASK                            0xFFFFFFFF
#define _IPC43_w_LENGTH                          0x00000020

#define _IPC44_U5EIS_POSITION                    0x00000018
#define _IPC44_U5EIS_MASK                        0x03000000
#define _IPC44_U5EIS_LENGTH                      0x00000002

#define _IPC44_U5EIP_POSITION                    0x0000001A
#define _IPC44_U5EIP_MASK                        0x1C000000
#define _IPC44_U5EIP_LENGTH                      0x00000003

#define _IPC44_w_POSITION                        0x00000000
#define _IPC44_w_MASK                            0xFFFFFFFF
#define _IPC44_w_LENGTH                          0x00000020

#define _IPC45_U5RXIS_POSITION                   0x00000000
#define _IPC45_U5RXIS_MASK                       0x00000003
#define _IPC45_U5RXIS_LENGTH                     0x00000002

#define _IPC45_U5RXIP_POSITION                   0x00000002
#define _IPC45_U5RXIP_MASK                       0x0000001C
#define _IPC45_U5RXIP_LENGTH                     0x00000003

#define _IPC45_U5TXIS_POSITION                   0x00000008
#define _IPC45_U5TXIS_MASK                       0x00000300
#define _IPC45_U5TXIS_LENGTH                     0x00000002

#define _IPC45_U5TXIP_POSITION                   0x0000000A
#define _IPC45_U5TXIP_MASK                       0x00001C00
#define _IPC45_U5TXIP_LENGTH                     0x00000003

#define _IPC45_I2C5BIS_POSITION                  0x00000010
#define _IPC45_I2C5BIS_MASK                      0x00030000
#define _IPC45_I2C5BIS_LENGTH                    0x00000002

#define _IPC45_I2C5BIP_POSITION                  0x00000012
#define _IPC45_I2C5BIP_MASK                      0x001C0000
#define _IPC45_I2C5BIP_LENGTH                    0x00000003

#define _IPC45_I2C5SIS_POSITION                  0x00000018
#define _IPC45_I2C5SIS_MASK                      0x03000000
#define _IPC45_I2C5SIS_LENGTH                    0x00000002

#define _IPC45_I2C5SIP_POSITION                  0x0000001A
#define _IPC45_I2C5SIP_MASK                      0x1C000000
#define _IPC45_I2C5SIP_LENGTH                    0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_I2C5MIS_POSITION                  0x00000000
#define _IPC46_I2C5MIS_MASK                      0x00000003
#define _IPC46_I2C5MIS_LENGTH                    0x00000002

#define _IPC46_I2C5MIP_POSITION                  0x00000002
#define _IPC46_I2C5MIP_MASK                      0x0000001C
#define _IPC46_I2C5MIP_LENGTH                    0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_U6EIS_POSITION                    0x00000000
#define _IPC47_U6EIS_MASK                        0x00000003
#define _IPC47_U6EIS_LENGTH                      0x00000002

#define _IPC47_U6EIP_POSITION                    0x00000002
#define _IPC47_U6EIP_MASK                        0x0000001C
#define _IPC47_U6EIP_LENGTH                      0x00000003

