is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg064.h
#define _U5MODE_STSEL_POSITION                   0x00000000
#define _U5MODE_STSEL_MASK                       0x00000001
#define _U5MODE_STSEL_LENGTH                     0x00000001

#define _U5MODE_PDSEL_POSITION                   0x00000001
#define _U5MODE_PDSEL_MASK                       0x00000006
#define _U5MODE_PDSEL_LENGTH                     0x00000002

#define _U5MODE_BRGH_POSITION                    0x00000003
#define _U5MODE_BRGH_MASK                        0x00000008
#define _U5MODE_BRGH_LENGTH                      0x00000001

#define _U5MODE_RXINV_POSITION                   0x00000004
#define _U5MODE_RXINV_MASK                       0x00000010
#define _U5MODE_RXINV_LENGTH                     0x00000001

#define _U5MODE_ABAUD_POSITION                   0x00000005
#define _U5MODE_ABAUD_MASK                       0x00000020
#define _U5MODE_ABAUD_LENGTH                     0x00000001

#define _U5MODE_LPBACK_POSITION                  0x00000006
#define _U5MODE_LPBACK_MASK                      0x00000040
#define _U5MODE_LPBACK_LENGTH                    0x00000001

#define _U5MODE_WAKE_POSITION                    0x00000007
#define _U5MODE_WAKE_MASK                        0x00000080
#define _U5MODE_WAKE_LENGTH                      0x00000001

#define _U5MODE_UEN_POSITION                     0x00000008
#define _U5MODE_UEN_MASK                         0x00000300
#define _U5MODE_UEN_LENGTH                       0x00000002

#define _U5MODE_RTSMD_POSITION                   0x0000000B
#define _U5MODE_RTSMD_MASK                       0x00000800
#define _U5MODE_RTSMD_LENGTH                     0x00000001

#define _U5MODE_IREN_POSITION                    0x0000000C
#define _U5MODE_IREN_MASK                        0x00001000
#define _U5MODE_IREN_LENGTH                      0x00000001

#define _U5MODE_SIDL_POSITION                    0x0000000D
#define _U5MODE_SIDL_MASK                        0x00002000
#define _U5MODE_SIDL_LENGTH                      0x00000001

#define _U5MODE_ON_POSITION                      0x0000000F
#define _U5MODE_ON_MASK                          0x00008000
#define _U5MODE_ON_LENGTH                        0x00000001

#define _U5MODE_PDSEL0_POSITION                  0x00000001
#define _U5MODE_PDSEL0_MASK                      0x00000002
#define _U5MODE_PDSEL0_LENGTH                    0x00000001

#define _U5MODE_PDSEL1_POSITION                  0x00000002
#define _U5MODE_PDSEL1_MASK                      0x00000004
#define _U5MODE_PDSEL1_LENGTH                    0x00000001

#define _U5MODE_UEN0_POSITION                    0x00000008
#define _U5MODE_UEN0_MASK                        0x00000100
#define _U5MODE_UEN0_LENGTH                      0x00000001

#define _U5MODE_UEN1_POSITION                    0x00000009
#define _U5MODE_UEN1_MASK                        0x00000200
#define _U5MODE_UEN1_LENGTH                      0x00000001

#define _U5MODE_USIDL_POSITION                   0x0000000D
#define _U5MODE_USIDL_MASK                       0x00002000
#define _U5MODE_USIDL_LENGTH                     0x00000001

#define _U5MODE_UARTEN_POSITION                  0x0000000F
#define _U5MODE_UARTEN_MASK                      0x00008000
#define _U5MODE_UARTEN_LENGTH                    0x00000001

#define _U5MODE_w_POSITION                       0x00000000
#define _U5MODE_w_MASK                           0xFFFFFFFF
#define _U5MODE_w_LENGTH                         0x00000020

#define _UJKMODE_STSEL_POSITION                  0x00000000
#define _UJKMODE_STSEL_MASK                      0x00000001
#define _UJKMODE_STSEL_LENGTH                    0x00000001

#define _UJKMODE_PDSEL_POSITION                  0x00000001
#define _UJKMODE_PDSEL_MASK                      0x00000006
#define _UJKMODE_PDSEL_LENGTH                    0x00000002

#define _UJKMODE_BRGH_POSITION                   0x00000003
#define _UJKMODE_BRGH_MASK                       0x00000008
#define _UJKMODE_BRGH_LENGTH                     0x00000001

#define _UJKMODE_RXINV_POSITION                  0x00000004
#define _UJKMODE_RXINV_MASK                      0x00000010
#define _UJKMODE_RXINV_LENGTH                    0x00000001

#define _UJKMODE_ABAUD_POSITION                  0x00000005
#define _UJKMODE_ABAUD_MASK                      0x00000020
#define _UJKMODE_ABAUD_LENGTH                    0x00000001

#define _UJKMODE_LPBACK_POSITION                 0x00000006
#define _UJKMODE_LPBACK_MASK                     0x00000040
#define _UJKMODE_LPBACK_LENGTH                   0x00000001

#define _UJKMODE_WAKE_POSITION                   0x00000007
#define _UJKMODE_WAKE_MASK                       0x00000080
#define _UJKMODE_WAKE_LENGTH                     0x00000001

#define _UJKMODE_UEN_POSITION                    0x00000008
#define _UJKMODE_UEN_MASK                        0x00000300
#define _UJKMODE_UEN_LENGTH                      0x00000002

#define _UJKMODE_RTSMD_POSITION                  0x0000000B
#define _UJKMODE_RTSMD_MASK                      0x00000800
#define _UJKMODE_RTSMD_LENGTH                    0x00000001

#define _UJKMODE_IREN_POSITION                   0x0000000C
#define _UJKMODE_IREN_MASK                       0x00001000
#define _UJKMODE_IREN_LENGTH                     0x00000001

#define _UJKMODE_SIDL_POSITION                   0x0000000D
#define _UJKMODE_SIDL_MASK                       0x00002000
#define _UJKMODE_SIDL_LENGTH                     0x00000001

#define _UJKMODE_ON_POSITION                     0x0000000F
#define _UJKMODE_ON_MASK                         0x00008000
#define _UJKMODE_ON_LENGTH                       0x00000001

#define _UJKMODE_PDSEL0_POSITION                 0x00000001
#define _UJKMODE_PDSEL0_MASK                     0x00000002
#define _UJKMODE_PDSEL0_LENGTH                   0x00000001

#define _UJKMODE_PDSEL1_POSITION                 0x00000002
#define _UJKMODE_PDSEL1_MASK                     0x00000004
#define _UJKMODE_PDSEL1_LENGTH                   0x00000001

#define _UJKMODE_UEN0_POSITION                   0x00000008
#define _UJKMODE_UEN0_MASK                       0x00000100
#define _UJKMODE_UEN0_LENGTH                     0x00000001

